{
  "data": [
    [
      {
        "range": "may 2021 - present",
        "name": "Deloitte Digital",
        "description": "Currently working on a website with Next.js, React.js, Redux Toolkit, RTK Query, HTML5, CSS3 (SASS/SCSS, responsive design), Material UI and Ant Design, I've also made a middleware server API with Nest.js and Typescript."
      },
      {
        "range": "june 2015 - aug 2015",
        "name": "Beta80 Group",
        "description": "Built an entity-relationship database using T-SQL which contained data about songs and authors and then I've built a Java7 application to fetch the data from the database in order to show them in the UI using the Java Swing library. Also stored the user credentials in the database with security checks."
      },
      {
        "range": "june 2014 - aug 2014",
        "name": "Nyx Solutions",
        "description": "Developed different wordpress websites, from a single page application to more complex ones, with forms and newsletter subscriptions."
      }
    ],
    [
      {
        "range": "may 2022",
        "name": "Pokedex Website",
        "description": "Built a website that allows the user to search data about a Pokemon with React and Typescript (into Next.js framework). Used the open source RESTful API PokeAPIv2 to fetch the JSON data. Open points: complex filter in the homepage, dark mode theme",
        "site": {
          "name": "Github",
          "link": "https://github.com/mataltamore/pokedex-site"
        }
      },
      {
        "range": "nov 2020 - apr 2021",
        "name": "NIST Lightweight Cryptography Competition",
        "description": "Made a theoretical attack to the Elephant (V1.1) cipher with the help of a script written in python and with a SAT Solver library."
      }
    ],
    [
      {
        "range": "sept 2016 - apr 2021",
        "name": "Univerity of Milan",
        "description": "Bachelor's Degree in Computer Science. My favorite courses were Algorithms and Data Structures, Databases, Software Engineer and Design Patterns, Cryptography"
      }
    ]
  ]
}
